/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   r_01_main.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: gmelissi <marvin@42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/08/28 23:45:39 by gmelissi          #+#    #+#             */
/*   Updated: 2021/08/29 00:14:44 by gmelissi         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

// обработать ошибки: argc > 2; argv не только из 1..4 и пробелов; цифр > 16

#include <unistd.h>
#include <stdlib.h>

int parse_input (char **av)

int main (int argc, char** argv)
{	
}
